       IDENTIFICATION DIVISION.
       PROGRAM-ID.                CREAR-STOCK01.
       DATE-WRITTEN.              9/2/2023.
       AUTHOR.                    LUCAS GALEANO.

       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT STOCK-MAESTRO ASSIGN TO "STOCK-MAESTRO.DAT"
                                  ORGANIZATION IS INDEXED
                                  RECORD KEY IS LLAVE-NUMERO-PRODUCTO
                                  ACCESS MODE IS DYNAMIC.

       DATA DIVISION.
       FILE SECTION.

       FD STOCK-MAESTRO.

          01 LLAVE.
           05 LLAVE-NUMERO-PRODUCTO PIC 9(2) VALUE ZEROS.
       01 REG-PRODUCTOS.
           88 FIN-ARCHIVO     VALUE HIGH-VALUE.
           05 NOMBRE-PRO      PIC X(20).
           05 CANTIDAD-INICIAL PIC 9(3).
           05 ENTRADA         PIC 9(3).
           05 SALIDA          PIC 9(3).
           05 TOTAL           PIC 9(3) VALUE ZEROS.
           05 VALOR-VENTA     PIC 9(5) VALUE ZEROS.

       WORKING-STORAGE SECTION.
       01 BOOLEANO                PIC XX.
           88 WS-VERDADERO        VALUE "SI".
           88 WS-FALSO            VALUE "NO".


       PROCEDURE DIVISION.
       005-SALTAR.
           DISPLAY "¿DESEAS VER EN PANTALLA EL STOCK ACTUALIZADO?".
           ACCEPT BOOLEANO.
       IF WS-VERDADERO
           GO TO 020-ABRIR-LEER-ARCHIVO
       ELSE
           EXIT
       END-IF.
       010-ABRIR-ESCRIBIR-ARCHIVO.

           OPEN OUTPUT STOCK-MAESTRO.
           DISPLAY "INGRESE EL PRODUCTO USANDO LA SIGUIENTE PLANTILLA"
                           " PARA FINALIZAR PRECIONE -ESPACIO-".
           PERFORM 030-INGRESE-PRODUCTO.
           PERFORM UNTIL REG-PRODUCTOS = SPACES
               WRITE REG-PRODUCTOS
               PERFORM 030-INGRESE-PRODUCTO
           END-PERFORM.
           PERFORM 025-CERRAR-ARCHIVO.

       020-ABRIR-LEER-ARCHIVO.
           OPEN INPUT STOCK-MAESTRO.
           READ STOCK-MAESTRO AT END SET FIN-ARCHIVO TO TRUE
           END-READ.
           PERFORM UNTIL FIN-ARCHIVO
               DISPLAY REG-PRODUCTOS
               READ STOCK-MAESTRO AT END SET FIN-ARCHIVO TO TRUE
               END-READ
           END-PERFORM.
           PERFORM 025-CERRAR-ARCHIVO.
           STOP RUN.


       025-CERRAR-ARCHIVO.
           CLOSE STOCK-MAESTRO.

       030-INGRESE-PRODUCTO.
           INITIALIZE LLAVE, REG-PRODUCTOS
           DISPLAY "NNPPPPPPPPPPPPPPPPPPPPIIIEEESSSTTT$$$$$".
           ACCEPT REG-PRODUCTOS.
           END PROGRAM CREAR-STOCK01.
      *>EL PARRAFO 030 SE REPETIA DOS VECES POR UN ERROR DE SINTAXIS EN
      *>LINEA 46, SE COLOCÓ STOP-RUN EN VEZ DE STOP RUN HACIENDO ASI QUE
      *> POR ORDEN SECUENCIAL DE LECTURA EL COMPILADOR LEA HASTA PARRAFO 030
      *> CAUSANDO ASI QUE NO PARACE EN PARRAFO 020 Y EJECURA POR SEGUNDA VEZ EL PARRAFO 030.
