       IDENTIFICATION DIVISION.
       PROGRAM-ID.                PROG-PAGOS-F.
       AUTHOR.                    LUCAS GALEANO.
       DATE-WRITTEN.              1/2/2023.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT REG-VENDEDORES ASSIGN TO "REG-MAESTRO.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD REG-VENDEDORES.
       01 VENDEDORES.
           05 NUM-EMPLEADOS       PIC 999.
           05 SUELDO-BASE         PIC 9(5).
           05 NUM-VENTAS          PIC 999.
           05 COB-VENTAS          PIC 9(5).
       WORKING-STORAGE SECTION.
       77 WS-CONTADOR-EMP         PIC 99 VALUE ZEROS.
       77 WS-CONTADOR-VEN         PIC 999 VALUE ZEROS.

       PROCEDURE DIVISION.
       BEGIN-DATOS.
           OPEN OUTPUT REG-VENDEDORES.
           DISPLAY "INTRODUZCA LOS DATOS SOLICITADOS."
           DISPLAY "INGRESE CANTIDAD DE EMPLEADOS:".
           ACCEPT NUM-EMPLEADOS.
           PERFORM ENTRADA-DATOS.
           PERFORM UNTIL WS-CONTADOR-EMP = NUM-EMPLEADOS
              WRITE VENDEDORES
              PERFORM ENTRADA-DATOS
           END-PERFORM.
           PERFORM VENT-COBROS.
           PERFORM UNTIL WS-CONTADOR-VEN = NUM-VENTAS
           WRITE VENDEDORES
           PERFORM VENT-COBROS
           END-PERFORM.
           CLOSE REG-VENDEDORES.
           STOP RUN.

       ENTRADA-DATOS.
           ADD 1 TO WS-CONTADOR-EMP.
           DISPLAY "INGRESE SUELDO BASE DE VENDEDOR ",WS-CONTADOR-EMP.
           ACCEPT SUELDO-BASE.
           DISPLAY "INGRESE CANT. DE VENTAS REALIZADAS:".
           ACCEPT NUM-VENTAS.

       VENT-COBROS.
              ADD 1 TO WS-CONTADOR-VEN
              DISPLAY "INGRESE EL COBRO DE VENTA ",WS-CONTADOR-VEN
              ACCEPT COB-VENTAS.
