       IDENTIFICATION DIVISION.
       PROGRAM-ID.                PROG-PAGOS-F.
       AUTHOR.                    LUCAS GALEANO.
       DATE-WRITTEN.              1/2/2023.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT REG-VENDEDORES ASSIGN TO "REG-MAESTRO.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT REG-VENTAS     ASSIGN TO "REG-VENTAS-MAESTRO.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD REG-VENDEDORES.
       01 VENDEDORES.
           05 EMPLEADOS              PIC 999.
           05 SUELDO-BASE            PIC 9(5).
           05 CANTIDAD-VENTAS        PIC 9.

       FD REG-VENTAS.
       01 COBRO-VENTAS               PIC 9(5).


       WORKING-STORAGE SECTION.
       01 WS-VENDEDORES.
           05 WS-EMPLEADO            PIC 999.
           05 WS-SUELDO-BASE         PIC 9(5).
           05 WS-CANTIDAD-VENTAS     PIC 9.

       01 WS-COBROS.
           05 WS-COBRO-VENTA         PIC 9(5).
           05 WS-NUM-EMPLEADO        PIC 99.



       01 WS-TABLAS.
           05 WS-TABLA-VENTAS OCCURS 3 TIMES.
               10 WS-TABLA-EMPLEADO   PIC 99.
               10 WS-TABLA-COBRO      PIC 9(5).

       77 WS-SUM-VENTAS              PIC 99.
       77 WS-CONTADOR                PIC 99 VALUE ZEROS.
       77 WS-RECAUDACION             PIC 9(6).


       PROCEDURE DIVISION.
       BEGIN-OUTPUT.
           OPEN OUTPUT REG-VENDEDORES.
           DISPLAY "INGRESE DATOS SOLICITADOS".
           PERFORM INGRESO-DATOS-EMPLEADOS.
           PERFORM UNTIL WS-VENDEDORES EQUALS SPACES
               WRITE VENDEDORES FROM WS-VENDEDORES
               PERFORM INGRESO-DATOS-EMPLEADOS
           END-PERFORM.

           DISPLAY "INGRESE N DE EMPLEADO Y COBROS DE CADA VENTA:"
           PERFORM INGRESO-VENTAS WITH TEST AFTER
                            UNTIL WS-CONTADOR EQUALS WS-SUM-VENTAS
               MOVE WS-COBROS TO WS-TABLA-VENTAS(1)
           CLOSE  REG-VENDEDORES.


       BEGIN-REPORT.
           OPEN INPUT REG-VENDEDORES.
           READ REG-VENDEDORES AT END MOVE HIGH-VALUE TO VENDEDORES
           END-READ.
           PERFORM VARYING WS-TABLAS FROM 01 BY 1
                           UNTIL WS-TABLAS GREATER THAN 3
           IF WS-TABLA-EMPLEADO(1) = EMPLEADOS
               ADD WS-TABLA-COBRO(1) TO WS-RECAUDACION
               DISPLAY "RECAUDACION DEL EMPLEADO ",EMPLEADOS
                        "ES IGUAL A:"WS-RECAUDACION
           END-IF
           READ REG-VENDEDORES AT END MOVE HIGH-VALUE TO VENDEDORES
           END-READ
           END-PERFORM.
           CLOSE REG-VENDEDORES.
           STOP RUN.

       INGRESO-DATOS-EMPLEADOS.
           DISPLAY "EEE$$$$$V".
           ACCEPT WS-VENDEDORES.
           IF WS-VENDEDORES NOT EQUAL SPACES
               ADD WS-CANTIDAD-VENTAS TO WS-SUM-VENTAS
           END-IF.

       INGRESO-VENTAS.
           ADD 1 TO WS-CONTADOR.
           DISPLAY "VV$$$$$".
           ACCEPT WS-COBROS.
