       IDENTIFICATION DIVISION.
       PROGRAM-ID.                PROG-EMP01.
       AUTHOR.                    LUCAS GALEANO.
       DATE-WRITTEN.              27/1/2023.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MASTER-EMPLOYEES ASSIGN TO "EMPLOYEE.DAT"
                  ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD MASTER-EMPLOYEES.
       01 EMPLOYEE-DETAILS.
           05 EMP-NUMBER          PIC 9(5).
           05 EMP-IDE.
              10 EMP-SUR          PIC X(15).
              10 EMP-NAME         PIC X(15).
           05 EMP-ID              PIC 9(8).
           05 EMP-GENDER          PIC X.
           05 SALARY              PIC 9(6).

       PROCEDURE DIVISION.
       BEGIN-OUTPUT.
           OPEN OUTPUT MASTER-EMPLOYEES.
           DISPLAY "INTRODUCE EMPLOYEE INFORMATION"
           DISPLAY "USE TEMPLATE BELOW, END INTRODUCING NO DATA."
           PERFORM EMPLOYEE-DATA-ENTRY.
           PERFORM UNTIL EMPLOYEE-DETAILS = SPACES
              WRITE EMPLOYEE-DETAILS
           PERFORM EMPLOYEE-DATA-ENTRY
           END-PERFORM.
           CLOSE MASTER-EMPLOYEES.
           STOP RUN.

       EMPLOYEE-DATA-ENTRY.
           DISPLAY "nnnnnSSSSSSSSSSSSSSSNNNNNNNNNNNNNNNIIIIIIIIS$$$$$$".
           ACCEPT EMPLOYEE-DETAILS.
           END PROGRAM PROG-EMP01.
